In [14]:
import pandas as pandas
import numpy as numpy

In [15]:
data = numpy.random.randn(4,3)

In [16]:
data

array([[-0.14236148, -0.83206781, -1.30054663],
       [ 1.10135665, -2.20752576,  0.84098105],
       [-1.04704805,  0.08970672,  0.55229292],
       [-0.58221348,  0.07920559, -0.31951925]])

In [17]:
dataFrame = pandas.DataFrame(data)

In [18]:
dataFrame

          0         1         2
0 -0.142361 -0.832068 -1.300547
1  1.101357 -2.207526  0.840981
2 -1.047048  0.089707  0.552293
3 -0.582213  0.079206 -0.319519

In [19]:
dataFrame[0]

0   -0.142361
1    1.101357
2   -1.047048
3   -0.582213
Name: 0, dtype: float64

In [20]:
type(dataFrame[0])

pandas.core.series.Series

In [21]:
newDataFrame = pandas.DataFrame(data,index=["Atil","Zeynep","Atlas","Mehmet"],columns = ["Maas","Yas","Calisma Saati"])

In [22]:
newDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.142361 -0.832068      -1.300547
Zeynep  1.101357 -2.207526       0.840981
Atlas  -1.047048  0.089707       0.552293
Mehmet -0.582213  0.079206      -0.319519

In [23]:
newDataFrame["Yas"]

Atil     -0.832068
Zeynep   -2.207526
Atlas     0.089707
Mehmet    0.079206
Name: Yas, dtype: float64

In [24]:
newDataFrame["Calisma Saati"]

Atil     -1.300547
Zeynep    0.840981
Atlas     0.552293
Mehmet   -0.319519
Name: Calisma Saati, dtype: float64

In [25]:
newDataFrame[["Maas","Yas"]]

            Maas       Yas
Atil   -0.142361 -0.832068
Zeynep  1.101357 -2.207526
Atlas  -1.047048  0.089707
Mehmet -0.582213  0.079206

In [26]:
newDataFrame["Atil"] ##row cekmek için bu yontem yanlıstır onun yerine newDataFrame.loc["Atil"] şeklinde olması gerekir

KeyError: 'Atil'

In [28]:
newDataFrame.loc["Atil"]

Maas            -0.142361
Yas             -0.832068
Calisma Saati   -1.300547
Name: Atil, dtype: float64

In [29]:
newDataFrame.loc["Zeynep"]

Maas             1.101357
Yas             -2.207526
Calisma Saati    0.840981
Name: Zeynep, dtype: float64

In [30]:
newDataFrame.iloc[1] #index location

Maas             1.101357
Yas             -2.207526
Calisma Saati    0.840981
Name: Zeynep, dtype: float64

In [31]:
newDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.142361 -0.832068      -1.300547
Zeynep  1.101357 -2.207526       0.840981
Atlas  -1.047048  0.089707       0.552293
Mehmet -0.582213  0.079206      -0.319519

In [32]:
newDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.142361 -0.832068      -1.300547
Zeynep  1.101357 -2.207526       0.840981
Atlas  -1.047048  0.089707       0.552293
Mehmet -0.582213  0.079206      -0.319519

In [33]:
newDataFrame["Emeklilik Yasi"] = newDataFrame["Yas"] * 2   #Add Column in DataFrame

In [34]:
newDataFrame

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -0.142361 -0.832068      -1.300547       -1.664136
Zeynep  1.101357 -2.207526       0.840981       -4.415052
Atlas  -1.047048  0.089707       0.552293        0.179413
Mehmet -0.582213  0.079206      -0.319519        0.158411

In [35]:
newDataFrame.drop("Emeklilik Yasi", axis=1) #axis => eksen

            Maas       Yas  Calisma Saati
Atil   -0.142361 -0.832068      -1.300547
Zeynep  1.101357 -2.207526       0.840981
Atlas  -1.047048  0.089707       0.552293
Mehmet -0.582213  0.079206      -0.319519

In [36]:
newDataFrame #değiskene yansımadı

            Maas       Yas  Calisma Saati  Emeklilik Yasi
Atil   -0.142361 -0.832068      -1.300547       -1.664136
Zeynep  1.101357 -2.207526       0.840981       -4.415052
Atlas  -1.047048  0.089707       0.552293        0.179413
Mehmet -0.582213  0.079206      -0.319519        0.158411

In [37]:
newDataFrame.drop("Emeklilik Yasi", axis=1,inplace=True) #inplace = yerinde

In [38]:
newDataFrame #inplace = true yapınca değişkene de yansımıs oldu

            Maas       Yas  Calisma Saati
Atil   -0.142361 -0.832068      -1.300547
Zeynep  1.101357 -2.207526       0.840981
Atlas  -1.047048  0.089707       0.552293
Mehmet -0.582213  0.079206      -0.319519

In [39]:
newDataFrame.drop("Mehmet") #axis =>  eksen default = 0

            Maas       Yas  Calisma Saati
Atil   -0.142361 -0.832068      -1.300547
Zeynep  1.101357 -2.207526       0.840981
Atlas  -1.047048  0.089707       0.552293

In [40]:
newDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.142361 -0.832068      -1.300547
Zeynep  1.101357 -2.207526       0.840981
Atlas  -1.047048  0.089707       0.552293
Mehmet -0.582213  0.079206      -0.319519

In [41]:
newDataFrame.loc["Atil"]["Maas"]

-0.1423614765100031

In [42]:
newDataFrame.loc["Atil"]["Yas"]

-0.8320678117046955

In [43]:
newDataFrame.loc["Atil","Yas"]

-0.8320678117046955

In [44]:
newDataFrame

            Maas       Yas  Calisma Saati
Atil   -0.142361 -0.832068      -1.300547
Zeynep  1.101357 -2.207526       0.840981
Atlas  -1.047048  0.089707       0.552293
Mehmet -0.582213  0.079206      -0.319519

In [45]:
booleanFrame = newDataFrame < 0

In [46]:
booleanFrame

         Maas    Yas  Calisma Saati
Atil     True   True           True
Zeynep  False   True          False
Atlas    True  False          False
Mehmet   True  False           True

In [47]:
newDataFrame[booleanFrame]

            Maas       Yas  Calisma Saati
Atil   -0.142361 -0.832068      -1.300547
Zeynep       NaN -2.207526            NaN
Atlas  -1.047048       NaN            NaN
Mehmet -0.582213       NaN      -0.319519

In [48]:
newDataFrame[newDataFrame < 0]

            Maas       Yas  Calisma Saati
Atil   -0.142361 -0.832068      -1.300547
Zeynep       NaN -2.207526            NaN
Atlas  -1.047048       NaN            NaN
Mehmet -0.582213       NaN      -0.319519

In [49]:
newDataFrame[newDataFrame["Yas"] > 0]

            Maas       Yas  Calisma Saati
Atlas  -1.047048  0.089707       0.552293
Mehmet -0.582213  0.079206      -0.319519

In [50]:
newDataFrame[newDataFrame["Calisma Saati"] > 0]

            Maas       Yas  Calisma Saati
Zeynep  1.101357 -2.207526       0.840981
Atlas  -1.047048  0.089707       0.552293

## Change Index

In [51]:
newDataFrame.reset_index() #row index 0,1,2,3

    index      Maas       Yas  Calisma Saati
0    Atil -0.142361 -0.832068      -1.300547
1  Zeynep  1.101357 -2.207526       0.840981
2   Atlas -1.047048  0.089707       0.552293
3  Mehmet -0.582213  0.079206      -0.319519

In [52]:
newDataFrame #you make inplace

            Maas       Yas  Calisma Saati
Atil   -0.142361 -0.832068      -1.300547
Zeynep  1.101357 -2.207526       0.840981
Atlas  -1.047048  0.089707       0.552293
Mehmet -0.582213  0.079206      -0.319519

In [53]:
newIndeksList = ["Ati","Zey","Atl","Meh"]

In [54]:
newDataFrame["New Index"] = newIndeksList

In [55]:
newDataFrame

            Maas       Yas  Calisma Saati New Index
Atil   -0.142361 -0.832068      -1.300547       Ati
Zeynep  1.101357 -2.207526       0.840981       Zey
Atlas  -1.047048  0.089707       0.552293       Atl
Mehmet -0.582213  0.079206      -0.319519       Meh

In [56]:
newDataFrame.set_index("New Index")

               Maas       Yas  Calisma Saati
New Index
Ati       -0.142361 -0.832068      -1.300547
Zey        1.101357 -2.207526       0.840981
Atl       -1.047048  0.089707       0.552293
Meh       -0.582213  0.079206      -0.319519

In [57]:
newDataFrame

            Maas       Yas  Calisma Saati New Index
Atil   -0.142361 -0.832068      -1.300547       Ati
Zeynep  1.101357 -2.207526       0.840981       Zey
Atlas  -1.047048  0.089707       0.552293       Atl
Mehmet -0.582213  0.079206      -0.319519       Meh

In [58]:
newDataFrame.set_index("New Index" , inplace=True) #değişekeni de değiştir

In [59]:
newDataFrame.loc["Ati"] #loc => get row

Maas            -0.142361
Yas             -0.832068
Calisma Saati   -1.300547
Name: Ati, dtype: float64

In [60]:
firstIndexs = ["Simpson","Simpson","Simpson","South Park","South Park","South Park"]

In [62]:
innerIndexs = ["Homer","Bart","Marge","Cartman","Kenny","Kyle"]

In [66]:
unitedIndexs = list(zip(firstIndexs,innerIndexs))

In [67]:
unitedIndexs

[('Simpson', 'Homer'),
 ('Simpson', 'Bart'),
 ('Simpson', 'Marge'),
 ('South Park', 'Cartman'),
 ('South Park', 'Kenny'),
 ('South Park', 'Kyle')]

In [68]:
unitedIndexs = pandas.MultiIndex.from_tuples(unitedIndexs)

In [70]:
type(unitedIndexs)

pandas.core.indexes.multi.MultiIndex

In [71]:
unitedIndexs

MultiIndex([(   'Simpson',   'Homer'),
            (   'Simpson',    'Bart'),
            (   'Simpson',   'Marge'),
            ('South Park', 'Cartman'),
            ('South Park',   'Kenny'),
            ('South Park',    'Kyle')],
           )

In [72]:
myCartoonList = [[40,"A"],[10,"B"],[30,"C"],[9,"D"],[10,"E"],[11,"F"]]

In [75]:
cartonNumpyArray = numpy.array(myCartoonList)

In [77]:
cartoonDataFrame = pandas.DataFrame(cartonNumpyArray,index=unitedIndexs,columns=["Yas","Meslek"])

In [78]:
cartoonDataFrame

                   Yas Meslek
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F

In [85]:
cartoonDataFrame.loc["Simpson"]

      Yas Meslek
Homer  40      A
Bart   10      B
Marge  30      C

In [86]:
cartoonDataFrame.loc["Simpson"].loc["Homer"]

Yas       40
Meslek     A
Name: Homer, dtype: object

In [87]:
cartoonDataFrame.loc["South Park"]

        Yas Meslek
Cartman   9      D
Kenny    10      E
Kyle     11      F

In [88]:
cartoonDataFrame.loc["South Park"].loc["Kyle"]

Yas       11
Meslek     F
Name: Kyle, dtype: object

In [89]:
cartoonDataFrame.index.names = ["Film Name","Name"]

In [90]:
cartoonDataFrame

                   Yas Meslek
Film Name  Name
Simpson    Homer    40      A
           Bart     10      B
           Marge    30      C
South Park Cartman   9      D
           Kenny    10      E
           Kyle     11      F